package exception;

public class Chapter11 {
//	クラスのメンバーは、何と何ですか？
//	◯　フィールドとメソッド
	
//	アクセス修飾子は、何種類ありますか？
//	×　２種類（publicとprivate）
//	正解は上記に「protected」「package-private」を加えた4種類
//	package-privateは無指定のときのデフォルトの値のことだと思う。
//	protectedはこれから習う
	
//	アクセス修飾子で、クラスに定義できるのは何と何ですか？
//	×　publicとprivate
//	正解はpublicとpackage-private
	
//	インスタンス生成時に呼び出されるメソッドを何と呼びますか？
//	◯　コンストラクタ
	
//	ディレクトリ階層でクラスをグループ化するしくみを何と呼びますか？
//	×
//	正解はパッケージ
//	パッケージもカリキュラムでは何をやっているのか理解できなかったのでやさしいjavaを読み進めよう
	
//	クラスで定義された変数を何変数と呼びますか？
//	×　インスタンス変数
//	正解はメンバ変数
//	フィールドで定義されている部分のことをメンバ変数と言うらしい
	
//	メソッド内で定義された変数を何変数と呼びますか？
//	◯　ローカル変数
	
//	クラスから直接呼び出しができるメソッドを何と呼びますか？
//	◯　クラスメソッド
//	解答ではstaticメソッド
//	オブジェクトに関連付けられておらずクラス全体に関連付けられたメソッドをクラスメソッドといい
//	staticを付けて表すのでクラスメソッドでも間違いではないとは思うんやけどな。
//	→調べたらやっぱり同義やった。
	
//	チェックする必要がない例外を何と呼びますか？
//	×
//	ランタイム例外
	
//	オブジェクト指向は、プログラムを何に見立ててプログラミングしますか？
//	◯　物
	
//	Javaで「型」というと、何を指しますか？
//	×　データの型式
//	クラス
	
//	クラスを実体化したものを何と呼びますか？
//	◯　インスタンス
	
//	正答率　6/12
//	用語は仕事をする上で重要になってくるそうなので覚えよう

}
